// if - если
// if - оператор логического условия в JS
// if - это способ проверить, выполняется ли определенное условие, и в зависимости от этого сделать определенные действия или выполнить определенный код

// Если солнце восходит (условие есть истинным) - мы планируем пойти на прогулку
// Если солнце не восходит (условие ложное) - мы остаемся дома

/*
Синтаксис if:

if(логическая операция, результатом которой будет Boolean){
    блок кода, который выполнится, если условие = true (истина)
}

*/

if(2 + 3 === 5) {
    console.log('Числа равны между собой!'); // Выполнится, если условие = true
}

// if-else
// if-else - иначе (в противном случае)

/*
Синтаксис if-else:

if(логическая операция, результатом которой будет Boolean) {
    блок кода, который будет выполнятся, если условие = екгу (истина)
} else {
    блок кода, которыйы будет выполнятся, если условие = false (ложь)
}

*/

if(2 + 2 === 5) {
    console.log('Числа равны между собой!'); // Выполнится, если условие = true
} else {
    console.log('Числа не равны между собой!'); // Выуолнится, если условие = false
}